week08/benchmark结果.txt
[20220120_15:19:01:381]root@gx3600:/home/liuboyuan# redis-benchmark -d 10 -t get,set  
[20220120_15:19:02:606]====== SET ======
[20220120_15:19:02:606]  100000 requests completed in 1.21 seconds
[20220120_15:19:02:607]  50 parallel clients
[20220120_15:19:02:607]  10 bytes payload
[20220120_15:19:02:607]  keep alive: 1
[20220120_15:19:02:607]
[20220120_15:19:02:618]98.38% <= 1 milliseconds
[20220120_15:19:02:619]99.58% <= 2 milliseconds
[20220120_15:19:02:619]99.69% <= 3 milliseconds
[20220120_15:19:02:619]99.87% <= 4 milliseconds
[20220120_15:19:02:619]99.90% <= 14 milliseconds
[20220120_15:19:02:619]99.91% <= 15 milliseconds
[20220120_15:19:02:619]99.92% <= 16 milliseconds
[20220120_15:19:02:619]99.93% <= 17 milliseconds
[20220120_15:19:02:620]99.95% <= 18 milliseconds
[20220120_15:19:02:620]99.95% <= 41 milliseconds
[20220120_15:19:02:620]100.00% <= 41 milliseconds
[20220120_15:19:02:620]82372.32 requests per second
[20220120_15:19:02:620]
[20220120_15:19:03:635]====== GET ======
[20220120_15:19:03:635]  100000 requests completed in 1.01 seconds
[20220120_15:19:03:635]  50 parallel clients
[20220120_15:19:03:635]  10 bytes payload
[20220120_15:19:03:637]  keep alive: 1
[20220120_15:19:03:637]
[20220120_15:19:03:649]99.56% <= 1 milliseconds
[20220120_15:19:03:649]99.83% <= 2 milliseconds
[20220120_15:19:03:649]99.95% <= 5 milliseconds
[20220120_15:19:03:649]99.97% <= 6 milliseconds
[20220120_15:19:03:650]100.00% <= 6 milliseconds
[20220120_15:19:03:650]98814.23 requests per second
[20220120_15:19:03:650]
[20220120_15:19:03:653]
[20220120_15:19:14:022]root@gx3600:/home/liuboyuan# redis-benchmark -d 20 -t get,set 
[20220120_15:19:14:983]====== SET ======
[20220120_15:19:14:983]  100000 requests completed in 0.95 seconds
[20220120_15:19:14:983]  50 parallel clients
[20220120_15:19:14:983]  20 bytes payload
[20220120_15:19:14:984]  keep alive: 1
[20220120_15:19:14:984]
[20220120_15:19:14:998]98.60% <= 1 milliseconds
[20220120_15:19:14:999]99.90% <= 2 milliseconds
[20220120_15:19:14:999]99.93% <= 3 milliseconds
[20220120_15:19:14:999]100.00% <= 4 milliseconds
[20220120_15:19:14:999]100.00% <= 4 milliseconds
[20220120_15:19:14:999]105263.16 requests per second
[20220120_15:19:14:999]
[20220120_15:19:15:966]====== GET ======
[20220120_15:19:15:967]  100000 requests completed in 0.96 seconds
[20220120_15:19:15:972]  50 parallel clients
[20220120_15:19:15:972]  20 bytes payload
[20220120_15:19:15:972]  keep alive: 1
[20220120_15:19:15:973]
[20220120_15:19:15:986]99.29% <= 1 milliseconds
[20220120_15:19:15:986]99.82% <= 2 milliseconds
[20220120_15:19:15:986]99.92% <= 3 milliseconds
[20220120_15:19:15:986]99.95% <= 5 milliseconds
[20220120_15:19:15:986]99.98% <= 6 milliseconds
[20220120_15:19:15:986]100.00% <= 6 milliseconds
[20220120_15:19:15:986]104058.27 requests per second
[20220120_15:19:15:986]
[20220120_15:19:15:990]
[20220120_15:19:39:423]root@gx3600:/home/liuboyuan#  redis-benchmark -d 50 -t get,set
[20220120_15:19:40:434]====== SET ======
[20220120_15:19:40:434]  100000 requests completed in 0.99 seconds
[20220120_15:19:40:435]  50 parallel clients
[20220120_15:19:40:435]  50 bytes payload
[20220120_15:19:40:435]  keep alive: 1
[20220120_15:19:40:435]
[20220120_15:19:40:448]98.48% <= 1 milliseconds
[20220120_15:19:40:448]99.82% <= 2 milliseconds
[20220120_15:19:40:448]99.92% <= 3 milliseconds
[20220120_15:19:40:448]99.96% <= 4 milliseconds
[20220120_15:19:40:448]100.00% <= 4 milliseconds
[20220120_15:19:40:454]100704.94 requests per second
[20220120_15:19:40:454]
[20220120_15:19:41:340]====== GET ======
[20220120_15:19:41:340]  100000 requests completed in 0.89 seconds
[20220120_15:19:41:340]  50 parallel clients
[20220120_15:19:41:340]  50 bytes payload
[20220120_15:19:41:340]  keep alive: 1
[20220120_15:19:41:340]
[20220120_15:19:41:352]99.37% <= 1 milliseconds
[20220120_15:19:41:353]99.83% <= 2 milliseconds
[20220120_15:19:41:353]99.95% <= 3 milliseconds
[20220120_15:19:41:353]99.98% <= 4 milliseconds
[20220120_15:19:41:353]100.00% <= 4 milliseconds
[20220120_15:19:41:353]112866.82 requests per second
[20220120_15:19:41:353]
[20220120_15:19:41:353]
[20220120_15:19:48:964]root@gx3600:/home/liuboyuan# redis-benchmark -d 100 -t get,set   
[20220120_15:19:49:904]====== SET ======
[20220120_15:19:49:904]  100000 requests completed in 0.92 seconds
[20220120_15:19:49:904]  50 parallel clients
[20220120_15:19:49:904]  100 bytes payload
[20220120_15:19:49:904]  keep alive: 1
[20220120_15:19:49:905]
[20220120_15:19:49:917]97.69% <= 1 milliseconds
[20220120_15:19:49:917]99.87% <= 2 milliseconds
[20220120_15:19:49:917]99.97% <= 3 milliseconds
[20220120_15:19:49:917]99.99% <= 4 milliseconds
[20220120_15:19:49:917]100.00% <= 5 milliseconds
[20220120_15:19:49:917]100.00% <= 5 milliseconds
[20220120_15:19:49:917]108342.37 requests per second
[20220120_15:19:49:918]
[20220120_15:19:50:831]====== GET ======
[20220120_15:19:50:832]  100000 requests completed in 0.91 seconds
[20220120_15:19:50:832]  50 parallel clients
[20220120_15:19:50:832]  100 bytes payload
[20220120_15:19:50:832]  keep alive: 1
[20220120_15:19:50:832]
[20220120_15:19:50:844]98.57% <= 1 milliseconds
[20220120_15:19:50:845]99.86% <= 2 milliseconds
[20220120_15:19:50:845]99.89% <= 3 milliseconds
[20220120_15:19:50:845]99.91% <= 4 milliseconds
[20220120_15:19:50:845]99.95% <= 5 milliseconds
[20220120_15:19:50:845]100.00% <= 5 milliseconds
[20220120_15:19:50:845]109409.20 requests per second
[20220120_15:19:50:845]
[20220120_15:19:50:845]
[20220120_15:20:24:469]root@gx3600:/home/liuboyuan# redis-benchmark -d 200 -t get,set  
[20220120_15:20:25:472]====== SET ======
[20220120_15:20:25:472]  100000 requests completed in 1.01 seconds
[20220120_15:20:25:472]  50 parallel clients
[20220120_15:20:25:473]  200 bytes payload
[20220120_15:20:25:473]  keep alive: 1
[20220120_15:20:25:473]
[20220120_15:20:25:485]98.36% <= 1 milliseconds
[20220120_15:20:25:485]99.82% <= 2 milliseconds
[20220120_15:20:25:485]99.90% <= 3 milliseconds
[20220120_15:20:25:485]99.90% <= 5 milliseconds
[20220120_15:20:25:485]99.90% <= 6 milliseconds
[20220120_15:20:25:485]99.95% <= 17 milliseconds
[20220120_15:20:25:485]99.99% <= 18 milliseconds
[20220120_15:20:25:485]100.00% <= 18 milliseconds
[20220120_15:20:25:486]99206.34 requests per second
[20220120_15:20:25:486]
[20220120_15:20:26:435]====== GET ======
[20220120_15:20:26:435]  100000 requests completed in 0.96 seconds
[20220120_15:20:26:435]  50 parallel clients
[20220120_15:20:26:435]  200 bytes payload
[20220120_15:20:26:435]  keep alive: 1
[20220120_15:20:26:436]
[20220120_15:20:26:450]98.61% <= 1 milliseconds
[20220120_15:20:26:450]99.71% <= 2 milliseconds
[20220120_15:20:26:451]99.84% <= 3 milliseconds
[20220120_15:20:26:451]99.99% <= 4 milliseconds
[20220120_15:20:26:451]100.00% <= 4 milliseconds
[20220120_15:20:26:451]104602.52 requests per second
[20220120_15:20:26:451]
[20220120_15:20:26:451]
[20220120_15:20:32:047]root@gx3600:/home/liuboyuan# redis-benchmark -d 5000 -t get,set     
[20220120_15:20:33:104]====== SET ======
[20220120_15:20:33:105]  100000 requests completed in 1.05 seconds
[20220120_15:20:33:105]  50 parallel clients
[20220120_15:20:33:105]  5000 bytes payload
[20220120_15:20:33:105]  keep alive: 1
[20220120_15:20:33:105]
[20220120_15:20:33:117]99.06% <= 1 milliseconds
[20220120_15:20:33:117]99.83% <= 2 milliseconds
[20220120_15:20:33:117]99.90% <= 3 milliseconds
[20220120_15:20:33:118]99.90% <= 4 milliseconds
[20220120_15:20:33:118]99.94% <= 5 milliseconds
[20220120_15:20:33:118]99.99% <= 6 milliseconds
[20220120_15:20:33:118]100.00% <= 6 milliseconds
[20220120_15:20:33:118]95147.48 requests per second
[20220120_15:20:33:118]
[20220120_15:20:34:262]====== GET ======
[20220120_15:20:34:262]  100000 requests completed in 1.14 seconds
[20220120_15:20:34:262]  50 parallel clients
[20220120_15:20:34:262]  5000 bytes payload
[20220120_15:20:34:262]  keep alive: 1
[20220120_15:20:34:263]
[20220120_15:20:34:275]99.05% <= 1 milliseconds
[20220120_15:20:34:276]99.92% <= 2 milliseconds
[20220120_15:20:34:276]99.97% <= 4 milliseconds
[20220120_15:20:34:276]100.00% <= 4 milliseconds
[20220120_15:20:34:276]87412.59 requests per second
[20220120_15:20:34:276]
[20220120_15:20:34:276]
[20220120_15:21:19:194]root@gx3600:/home/liuboyuan# redis-benchmark -d 1000 -t get,set  
[20220120_15:21:20:162]====== SET ======
[20220120_15:21:20:162]  100000 requests completed in 0.95 seconds
[20220120_15:21:20:162]  50 parallel clients
[20220120_15:21:20:162]  1000 bytes payload
[20220120_15:21:20:162]  keep alive: 1
[20220120_15:21:20:162]
[20220120_15:21:20:179]99.07% <= 1 milliseconds
[20220120_15:21:20:179]99.90% <= 2 milliseconds
[20220120_15:21:20:179]99.97% <= 4 milliseconds
[20220120_15:21:20:179]100.00% <= 4 milliseconds
[20220120_15:21:20:187]105596.62 requests per second
[20220120_15:21:20:187]
[20220120_15:21:21:188]====== GET ======
[20220120_15:21:21:189]  100000 requests completed in 1.00 seconds
[20220120_15:21:21:189]  50 parallel clients
[20220120_15:21:21:189]  1000 bytes payload
[20220120_15:21:21:189]  keep alive: 1
[20220120_15:21:21:190]
[20220120_15:21:21:200]98.99% <= 1 milliseconds
[20220120_15:21:21:200]99.86% <= 2 milliseconds
[20220120_15:21:21:200]99.90% <= 3 milliseconds
[20220120_15:21:21:200]99.91% <= 4 milliseconds
[20220120_15:21:21:200]99.93% <= 5 milliseconds
[20220120_15:21:21:200]99.95% <= 13 milliseconds
[20220120_15:21:21:200]99.97% <= 14 milliseconds
[20220120_15:21:21:200]99.99% <= 15 milliseconds
[20220120_15:21:21:201]100.00% <= 15 milliseconds
[20220120_15:21:21:201]99800.40 requests per second